app/Controllers/Admin/ProdukController.php

SELECT *
FROM `wisata`
ORDER BY `id` DESC
---
    public function index(){


        $data = [
            'title' => 'Daftar Wisata',
            'daftar_wisata' => $this->WisataModel->orderBy('id','DESC')->findAll()
      ];