app/Controllers/Wisata.php

    public function edit_data_wisata($id = false){
        $wisata_model = new WisataModel();
        $data_wisata = $wisata_model->find($id); //Mencari DATA sesuai ID
---
SELECT *
FROM `wisata`
WHERE `wisata`.`id` = '18'